@extends('layouts.app')

@section('content')
    <div class="container">
        <div class="row">
            <div class="col-md-12">
                <h1>College Web API v 1.0</h1>
                <h2>Загальні положення</h2>
                <p>
                    College Web API засновано на використанні Bearer Token. Для отримання доступу до сервісів ХПФК необхідно
                    авторизуватися в API за допомогою логіна і пароля від вашого облікового запису електронного журналу.
                    Токен, який надається вам для доступу до сервісів є індивідуальним. Не передавайте його стороннім
                    особам!
                </p>
                <p>
                    Функції College Web API призначені для створення застосунків на різних платформах, що даватимуть
                    користувачу доступ до інформації, яка міститься у базах даних коледжу.
                </p>
                <h2>Авторизація та отримання токена</h2>
                <p>
                    Послідовність авторизації у College Web API 1.0 наступна:
                </p>
                <ol>
                    <li>
                        Виконайте AJAX-запит методом GET за адресою http://api.college.ks.ua/sanctum/csrf-cookie
                    </li>
                    <li>
                        Після отримання cookie з ключами CSRF надішліть POST-запит у форматі AJAX, для чого у заголовки
                        HTTP-запиту необхідно додати заголовок "X-Requested-With" зі значенням "XMLHttpRequest", за адресою
                        http://forum.college.ks.ua/api/login . Додатково вкажіть параметри login та password, їх значення
                        мають відповідати обліковим даним користувача, який хоче отримати доступ до API
                    </li>
                    <li>
                        Якщо запит був успішним, вам у відповідь буде повернено інформацію про користувача та токен, який
                        необхідно зберегти. Увага! Під час кожної авторизації створюється новий токен! Не виконуйте нову
                        авторизацію, якщо маєте діючий токен.
                    </li>
                    <li>
                        Збережений токен використовується для всіх подальших звернень до API. Зберігання логіну та паролю
                        більше не потрібне!
                    </li>
                    <li>
                        Всі подальші запити з токеном повинні бути у форматі AJAX, для чого у заголовки HTTP-запиту
                        необхідно
                        додати заголовок "X-Requested-With" зі значенням "XMLHttpRequest" та заголовок "Authorization" зі
                        значенням "Bearer отриманий_раніше_токен"
                    </li>
                    <li>
                        Для перевірки чинності токена зверніться GET-запитом за адресою
                        http://api.college.ks.ua/api/users/profile/my . У разі, якщо токен чинний, ви отримаєте інформацію
                        про користувача.
                    </li>
                </ol>
                <h2>Доступні функції</h2>
                <h3>Перевірка існуючого токена</h3>
                <h3>Перевірка пароля Moodle</h3>
                <h3>Перегляд замін</h3>
            </div>
        </div>
    </div>
@endsection
